{
  "home": {
    "name": "Ciril Arockiaraj",
    "role": "Software Developer | Full Stack Developer | AI - Research & Prompting",
    "comments": "I design and develop intelligent, high-performance digital solutions that merge innovation with modern technology to deliver outstanding user experiences.",
    "socialLinks": [
      {
        "icon": "fab fa-linkedin-in",
        "url": "https://linkedin.com/in/ciril-arockiaraj-s-b3085930b",
        "label": "LinkedIn"
      },
      {
        "icon": "fab fa-github",
        "url": "https://github.com/cirilarockiaraj",
        "label": "GitHub"
      },
      {
        "icon": "fa-brands fa-x-twitter",
        "url": "https://x.com/cirilarockiaraj",
        "label": "X"
      },
      {
        "icon": "fab fa-instagram",
        "url": "https://www.instagram.com/ciril804?igsh=MTJ3MHBnaTdmbzZucw==",
        "label": "Instagram"
      },
      {
        "icon": "fab fa-facebook-f",
        "url": "https://www.facebook.com/share/1GWyVgpoeo/",
        "label": "Facebook"
      }
    ]
  },
  "about": {
    "name": "Ciril Arockiaraj",
    "role": "Software Developer",
    "comments": "Motivated software developer with over 2+ years of hands-on experience in full-stack development. Skilled in building scalable, high-quality web and enterprise applications using modern technologies. My expertise covers frontend frameworks, backend architecture, and cloud deployment. I take pride in writing clean, efficient code and crafting seamless, user-centric digital experiences.",
    "imageUrl": "https://customer-assets.emergentagent.com/job_webdev-ciril/artifacts/435mecje_profile.jpg",
    "experience": "2+ years",
    "projects": "5+ Projects",
    "client": "1 Client",
    "interests": [
      "Web Development",
      "AI & Machine Learning",
      "API Development",
      "Open Source"
    ]
  },
  "skills": {
    "mainSkills": [
      {
        "name": "HTML",
        "percentage": 80,
        "color": "#e34c26",
        "description": "Proficient in writing semantic, standards-compliant HTML5 code optimized for accessibility and performance across modern browsers."
      },
      {
        "name": "CSS",
        "percentage": 60,
        "color": "#264de4",
        "description": "Skilled in crafting responsive and visually appealing layouts using CSS3, Flexbox, Grid, and modern animation techniques, including SCSS pre-processing."
      },
      {
        "name": "JavaScript",
        "percentage": 65,
        "color": "#f0db4f",
        "description": "Strong understanding of ES6+, asynchronous programming, DOM manipulation, and building dynamic interfaces using modern JavaScript frameworks."
      },
      {
        "name": "Java",
        "percentage": 80,
        "color": "#5382a1",
        "description": "Experienced in Java application development using OOP principles, Spring Boot framework, and building scalable enterprise-grade backends."
      },
      {
        "name": "Guidewire",
        "percentage": 40,
        "color": "#5382a1",
        "description": "Hands-on experience with Guidewire PolicyCenter, including policy form patterns, entity configuration, and custom form inference logic."
      },
      {
        "name": "Python",
        "percentage": 70,
        "color": "#3776ab",
        "description": "Proficient in Python for web applications, automation, and data-driven systems using frameworks such as Flask and Django."
      }
    ],
    "additionalSkills": [
      "Angular",
      "React",
      "TypeScript",
      "MongoDB",
      "MS SQL",
      "MySQL",
      "Git",
      "Tortoise SVN",
      "REST APIs"
    ]
  },
  "resume": {
    "experience": [
      {
        "role": "Software Developer",
        "company": "Newdream Data Systems",
        "duration": "2023 - Present",
        "comments": "Contributed to the development and maintenance of enterprise-grade applications using Guidewire, Spring Boot, Angular, React, and Python. Collaborated closely with cross-functional teams to deliver robust, efficient, and scalable solutions."
      }
    ],
    "projects": [
      {
        "name": "Guidewire policy center",
        "client": "Western Reserve Group",
        "technologies": "Gosu, entities, policy form patterns, custom form inference",
        "description": "Engineered custom functionalities and configurations for the Guidewire PolicyCenter using Gosu programming and entity design, tailored to meet complex client-specific insurance workflows and data requirements."
      },
      {
        "name": "MuleSoft to SnapLogic Migration",
        "client": "Internal Product",
        "technologies": "Angular, Spring Boot",
        "description": "Developed a migration framework to convert MuleSoft workflows into SnapLogic pipelines using Angular and Spring Boot, enabling seamless API integration, transformation, and automated data migration."
      },
      {
        "name": "AI - Research",
        "client": "Internal Product",
        "technologies": "Python, AWS Bedrock, Azure AI Foundry",
        "description": "Built intelligent AI-driven applications leveraging LLMs and RAG architectures for data extraction, reasoning, and analysis using AWS Bedrock and Azure AI Foundry ecosystems."
      },
      {
        "name": "CESR2 (Cession - Excel to requirement)",
        "client": "Portfolio",
        "technologies": "Python, Azure AI Foundry, Angular",
        "description": "Developed an AI-based system to extract Excel formulas and translate them into clear, user-friendly business explanations. Implemented backend logic using Python and Azure AI Foundry (OpenAI 4.1) to interpret formulas accurately, and built an Angular-based frontend to present formulas, mappings, and derived business logic. Worked extensively on mapping Excel tables, row and column labels, and formula dependencies to improve explanation accuracy, while ensuring structured and reliable outputs suitable for regulatory and financial use cases."
      }
    ],
    "education": [
      {
        "degree": "Master of Science in Computer Science",
        "institution": "St. Joseph's College(Autonomous), Tiruchirappalli",
        "year": "2021 - 2023",
        "description": "Specialized in software engineering, data science, and advanced computing methodologies, focusing on real-world software development practices."
      },
      {
        "degree": "Bachelor of Computer Applications",
        "institution": "St. Joseph's College(Autonomous), Tiruchirappalli",
        "year": "2018 - 2021",
        "description": "Gained a strong foundation in computer science principles, programming, and software design through practical projects and coursework."
      }
    ]
  },
  "chatbot": {
    "model": "arcee-ai/trinity-mini:free",
    "apiKey": "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",
    "resume_content": "Ciril Arockiaraj S\n Software Developer\n cirilarockiaraj@gmail.com | https://linkedin.com/in/ciril-arockiaraj-s-b3085930b | https://cirilarockiaraj.github.io/ciril-profile/ |\n +91-6382810644\n \n Profile Summary\n Software Developer with 2+ years of experience in enterprise application development, system integration, and AI-driven solutions.\n Strong background in Guidewire PolicyCenter customization, backend development using Java Spring Boot, and Python-based AI research projects.\n Hands-on experience in migrating integration platforms (MuleSoft to SnapLogic), building intelligent document processing solutions for complex PDFs and Excel files, and developing business logic explainers using LLMs.\n Adept at working across insurance, banking, and regulatory domains, with a focus on automation, accuracy, and scalable system design.\n \n Technical Skills\n Core Java, Python, Spring Boot, Fast API, Flask, MS SQL Server, Selenium, HTML, CSS, Angular, Azure AI Foundry, Open AI APIs\n \n Professional Experience\n Software Developer\n [Newdream Data Systems] | [Duration: March 2023 – Present]\n \n Guidewire Development\n • Developed and customized Guidewire PolicyCenter forms and entities, ensuring alignment with business and insurance domain requirements.\n • Worked on data modeling, UI configurations, and validation logic within Guidewire frameworks.\n • Collaborated with functional teams to translate business rules into configurable Guidewire components.\n \n Integration Migration: MuleSoft to SnapLogic\n • Played a key role in migrating integration workflows from MuleSoft to SnapLogic.\n • Designed and implemented backend services using Java Spring Boot to support SnapLogic pipelines.\n • Converted existing MuleSoft logic into optimized SnapLogic pipelines while maintaining data integrity and performance.\n • Worked with JSON templates and REST APIs to ensure seamless system communication.\n \n AI Research – Intelligent PDF Chatbot\n • Designed and developed an AI-based PDF chatbot capable of handling complex, lengthy documents such as bank statements and financial reports.\n • Implemented solutions using Python, Azure AI Foundry (OpenAI 4.1), and ChromaDB for semantic search and retrieval.\n • Built document ingestion pipelines including text extraction, chunking, embedding generation, and contextual Q&A.\n • Focused on accuracy, performance, and handling unstructured financial data.\n \n CESR2 Project – Excel Formula Business Explanation\n • Developed an AI-assisted system to extract Excel formulas and convert them into clear business explanations.\n • Implemented backend logic using Python and Azure AI Foundry (OpenAI 4.1) for formula interpretation and reasoning.\n • Built a frontend interface using Angular to display extracted formulas, mappings, and business logic explanations.\n • Worked extensively on mapping Excel tables, row/column labels, and formula dependencies to improve explanation accuracy.\n • Ensured regulatory and financial data clarity for end users through structured outputs.\n \n Education\n • Master of Science in Computer Science (2021 – 2023)\n St. Joseph’s College (Autonomous), Tiruchirappalli.\n • Bachelor of Computer Applications (2018 – 2021)\n St. Joseph’s College (Autonomous), Tiruchirappalli.\n "
  },
  "contact": {
    "address": "780, Mela theru, Mullaiyur, Viralimalai, Pudukkottai, Tamil Nadu.",
    "phone": "+91 6382810644",
    "email": "cirilarockiaraj@gmail.com",
    "mapEmbedPath": "https://www.google.com/maps/embed?pb=!1m17!1m12!1m3!1d713.8594576587499!2d78.5936403452824!3d10.605843346436743!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m2!1m1!2s!5e1!3m2!1sen!2sin!4v1761965623877!5m2!1sen!2sin"
  },
  "resumeDownloadUrl": "https://drive.google.com/uc?export=download&id=1Y5OsehOhGvP6bphSLsRxnIf3QzEt4iuC"
}